app/Controllers/Auth.php

    public function verif()
    {
        // dd($this->request->getVar());
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $login1 = $this->usersModel->where('username', $username)->where('Password', $password)->get()->getRowArray();
        $login2 = $this->dokterModel->where('username', $username)->where('Password', $password)->get()->getRowArray();
        $login3 = $this->pasienModel->where('username', $username)->where('Password', $password)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `username` = 'susi'
AND `Password` = 'susi123'
SELECT *
FROM `dokter`
WHERE `username` = 'susi'
AND `Password` = 'susi123'
SELECT *
FROM `pasien`
WHERE `username` = 'susi'
AND `Password` = 'susi123'