app/Controllers/Booking.php

    public function index()
    {
        // $data['title'] = 'Data Master';
        $data['booking'] = $this->bookingModel->where('id_pasien', session('id'))
            ->join('dokter', 'booking.id_dokter=dokter.id_dokter')->get()->getResultArray();
---
SELECT *
FROM `booking`
JOIN `dokter` ON `booking`.`id_dokter`=`dokter`.`id_dokter`
WHERE `id_pasien` = '7'

    public function tambah_jam()
    {
        $data['booking'] = $this->bookingModel->get()->getResultArray();
        $data['dokter']  = $this->dokterModel->get()->getResultArray();

        $jadwal = $this->dokterModel->select('jadwal')->get()->getResultArray();








        // dd($booking);
         if ($this->request->getVar('submit')) {
            // dd($this->request->getVar());

             $time = date('H:i',strtotime($this->request->getVar('untuk_jam')));


            $this->bookingModel
                ->set('untuk_tanggal', $this->request->getVar('untuk_tanggal'))
                ->set('id_pasien', session('id'))
                ->set('tanggal_booking', date('y:m:d'))
                ->set('untuk_jam', $time)
                ->insert();
---
SELECT *
FROM `booking`
SELECT *
FROM `dokter`
SELECT `jadwal`
FROM `dokter`
INSERT INTO `booking` (`untuk_tanggal`, `id_pasien`, `untuk_jam`) VALUES ('2023/12/04', '7', '11:00')

    public function tambah($id)
    {
        session();
        $booking = $this->bookingModel->where('id_booking', $id)->get()->getRowArray();
        $data['b'] = $this->bookingModel->where('id_booking', $id)->get()->getRowArray();
        $id_book = $booking['id_booking'];
        $tanggal = date('l',strtotime($booking['untuk_tanggal']));
        $pilih_jam = $booking['untuk_jam'];





        $dokter= $this->dokterModel->select('id_dokter,nama,jadwal')->where('jadwal',$tanggal)->get()->getResultArray();
        $j_dokter = $this->dokterModel->select('id_dokter,nama,jadwal');
        $data['dokter'] = $j_dokter->like('jadwal',$tanggal)->get()->getRowArray();


        $dok = $this->dokterModel->select('id_dokter,nama,jadwal,jam_masuk');


        $data['dj'] = $dok->like('jadwal',$tanggal)->get()->getResultArray();
---
SELECT *
FROM `booking`
WHERE `id_booking` = '22'
SELECT `id_dokter`, `nama`, `jadwal`
FROM `dokter`
WHERE `jadwal` = 'Monday'
SELECT `id_dokter`, `nama`, `jadwal`
FROM `dokter`
WHERE `jadwal` LIKE '%Monday%' ESCAPE '!'
SELECT `id_dokter`, `nama`, `jadwal`, `jam_masuk`
FROM `dokter`
WHERE `jadwal` LIKE '%Monday%' ESCAPE '!'

    public function dokter()
    {
        // $data['title'] = 'Data Master';
        $data['booking'] = $this->bookingModel
            ->where('id_dokter', session('id'))
            ->select('booking.*, pasien.nama as nama_pasien')
            ->join('pasien', 'booking.id_pasien=pasien.id_pasien')
            ->get()->getResultArray();
---
SELECT `booking`.*, `pasien`.`nama` as `nama_pasien`
FROM `booking`
JOIN `pasien` ON `booking`.`id_pasien`=`pasien`.`id_pasien`
WHERE `id_dokter` = '2'