app/Controllers/Dokter.php

SELECT *
FROM `dokter`
---
    public function jadwal()
    {
        session();
        $data['dokter'] = $this->dokterModel->get()->getRowArray();
        $data['dokteran'] = $this->dokterModel->get()->getResultArray();

        $data_d = $this->dokterModel->get()->getRowArray();
        $data['jadwalan'] = $this->dokterModel->get()->getResultArray();

SELECT *
FROM `dokter`
WHERE `id_dokter` = '2'
SELECT *
FROM `dokter`
---
    public function editjadwal($id)
    {
     $data['d'] = $this->dokterModel->where('id_dokter',$id)->get()->getRowArray();
     $data_d = $this->dokterModel->where('id_dokter',$id)->get()->getRowArray();
     $j = $data_d['jadwal'];
     $data['dokter'] = $this->dokterModel->get()->getResultArray();

SELECT *
FROM `dokter`
WHERE `id_dokter` = '2'
SELECT *
FROM `dokter`
---
    public function pilihjam($id)
    {
     $data['d'] = $this->dokterModel->where('id_dokter',$id)->get()->getRowArray();
     $data_d = $this->dokterModel->where('id_dokter',$id)->get()->getRowArray();
     $jam = $data_d['jadwal'];

     $data['dokter'] = $this->dokterModel->get()->getResultArray();

     $data['j'] = explode(",",$jam);

     $data_d = $this->dokterModel->get()->getRowArray();

UPDATE `dokter` SET `jam_masuk` = '2,2,2'
WHERE `id_dokter` = '2'
---
        $check_jam = $_POST['pilih_jam'];
        $jam = implode(',', $check_jam);

        $this->dokterModel
        ->set('jam_masuk', $jam)
        ->where('id_dokter',$id)
        ->update();