app/Controllers/Home.php

SELECT *
FROM `layanan`
WHERE `active` = 1
---
    public function home()
    {
        session();
        $data['layanan'] = $this->layananModel->where('active' ,1)->get()->getResultArray();